#+TITLE: Day 2

* Part 1
** Example

#+begin_src python :results replace output :session day_2 :exports both
import pandas as pd

df = pd.DataFrame(
    [
        ["forward", 5],
        ["down", 5],
        ["forward", 8],
        ["up", 3],
        ["down", 8],
        ["forward", 2],
    ],
    columns=["direction", "value"],
)

df.convert_dtypes()


f = df["value"].where(df["direction"] == "forward").sum()
print(f)

up = df["value"].where(df["direction"] == "up").sum()
down = df["value"].where(df["direction"] == "down").sum()
depth = down - up
print(depth)

print(depth * f)
#+end_src

** Real

#+begin_src python :results replace output :session day_2 :exports both
import pandas as pd

df = pd.read_csv(
    "./part_1_input.txt",
    sep=" ",
    header=None,
    names=["direction", "value"],
)

print(df.head())

df.convert_dtypes()


f = df["value"].where(df["direction"] == "forward").sum()
print(f)

up = df["value"].where(df["direction"] == "up").sum()
down = df["value"].where(df["direction"] == "down").sum()
depth = down - up
print(depth)

print(depth * f)
#+end_src

#+RESULTS:
:   direction  value
: 0   forward      9
: 1   forward      7
: 2   forward      4
: 3      down      7
: 4   forward      5
: 2052.0
: 1032.0
: 2117664.0


* Part 2
** Example


#+begin_src python :results replace output :session day_2 :exports both
import pandas as pd

example = pd.DataFrame(
    [
        ["forward", 5],
        ["down", 5],
        ["forward", 8],
        ["up", 3],
        ["down", 8],
        ["forward", 2],
    ],
    columns=["direction", "value"],
)

example.convert_dtypes()


aim = 0
depth = 0
for row in example.itertuples():
    print(row.direction)
    if row.direction == "forward":
        depth = depth + aim * row.value
    elif row.direction == "up":
        aim = aim - row.value
    elif row.direction == "down":
        aim = aim + row.value

print(example.head())

horizontal = example["value"].where(example["direction"] == "forward").sum()
print(horizontal)

print(depth * horizontal)
#+end_src

#+RESULTS:
#+begin_example
forward
down
forward
up
down
forward
  direction  value
0   forward      5
1      down      5
2   forward      8
3        up      3
4      down      8
15.0
900.0
#+end_example
